trade_exp/src/Documents/ОрдерНаОтражениеНедостачТоваров/ОрдерНаОтражениеНедостачТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b8875900-c91c-4f5c-a6db-eb5c60bbf5c1">
  <name>ОрдерНаОтражениеНедостачТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d23390f6-f0f8-490e-863c-47a5de9044d3">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91b606d8-8510-495a-a8c6-1b5e235249b0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2510513-0cf8-46b9-b5b7-e37462c346bd">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c40623de-3ddf-4dcd-a0b7-6233f36d471d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6467e29-65ed-4961-afee-aae0e4ee338d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f6107ebc-ff8b-4e7d-81d9-600e2d3cc664">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a3c09b68-284b-4200-9a4c-3d273fa46b68">
    <name>ПодтвержденСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d890bcee-c92d-4bf4-95ba-a05dfbcb70a3">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="07cd26ff-6cdd-46cc-ab48-42ab100712e8">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="123028d1-e823-4506-af2e-db75b75d8370">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83cab3da-703a-46c6-82d0-bfaed7026af1">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="027bdb0d-b866-4248-b2fc-f5c140c52a06">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f59f8a54-9392-48ee-bfeb-7dd9773cf01d">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="05468525-03c5-43c8-84f1-56d83d6ba933">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="acee50c2-3241-4b78-8fb0-fa2e43cdf0ea">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cd5cf2-becc-47fc-acc1-3f5e388de5cc">
    <name>ПокупкаПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="017e9b68-db4c-46f6-88bb-302b1d077101">
    <name>ДопоставкаНеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0192c7a0-d8f4-421f-84c3-0422e7c325bf">
    <name>ПерепоставленноеДарится</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47556336-3f8c-4d55-9a13-9637c157cae2">
    <name>ТребуетсяДопоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7be36844-c452-4b1b-b08c-6918502de0d0">
    <name>ОтгрузитьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f22e447b-d61a-47cc-88c8-6ee796c1e050">
    <name>НедостачаНеПризнана</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1b2d946d-c9f5-4037-8399-87421b020da2">
    <name>ВозвратПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f534a5d7-38e3-40b1-a5a3-1b2ebd98de08">
    <name>ОприходоватьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ОрдерНаОтражениеНедостачТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеНедостачТоваров") Тогда
		
		Склад = ДанныеЗаполнения.Склад;
		
		Для каждого Строка из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.КоличествоУпаковок = Строка.Количество;
		КонецЦикла;

			
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") Тогда
		
		Основание =ДанныеЗаполнения.Ссылка;
		Склад = ДанныеЗаполнения.СкладОтправитель;
		
		Для каждого Строка из ДанныеЗаполнения.Товары Цикл
			//+Альтерра
			Если Строка.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка,,"Назначение");
				КоличУпаковок = Строка.КоличествоУпаковок - Строка.КоличествоУпаковокПоДокументу;
				МодульКоличУпаковок = Макс(КоличУпаковок, -КоличУпаковок);
				НоваяСтрока.КоличествоУпаковок = МодульКоличУпаковок;
				НоваяСтрока.Количество = МодульКоличУпаковок;
			КонецЕсли;	
			//-	
			
			//-Альтерра
			//НоваяСтрока = Товары.Добавить();
			//ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			//НоваяСтрока.КоличествоУпаковок = 0;
			//НоваяСтрока.Количество = 0;
			//-
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
		
		Основание =ДанныеЗаполнения.Ссылка;
		Склад = ДанныеЗаполнения.Склад;
		
		Для каждого Строка из ДанныеЗаполнения.Расхождения Цикл
			Если Строка.КоличествоУпаковок < 0 Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.КоличествоУпаковок = (-1)*Строка.КоличествоУпаковок;
			НоваяСтрока.Количество = (-1)*Строка.Количество;
			КонецЕсли;	
		КонецЦикла;

	КонецЕсли;
КонецПроцедуры


&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
    //Альтерра
	ДопМодуль.КонтрольОстатков(ЭтотОбъект,Отказ);
    //-Альтерра

КонецПроцедуры

#КонецЕсли
